drcoolj/msp430_lampa_rc5/main.c
/**
 * \file main.c
 *
 *  Created on: 22.02.2015
 *      Author: Jacek
 *
 *
 *  Opis:
 *  Procesor
 *  - zegar
 *  	zegar wewn 16/1 MHZ
 *  	zegar zewn
 *
 *  - Porty
 *  	Port OUT 1.6 PWM sterowany sprzetowo zegarem PWM OUT / programowo przez Timer A1
 *  	Port OUT 1.0 blink
 *  	Port  IN 1.4 wejscia IR
 *
 *
 *  Logika:
 *  Uruchomienie / Inicjalizacja
 *  - inicjalizacja portow
 *  - po wlaczeniu ustawienie domyslnego wyjscia
 *  - przejscie w tryb uspienia / Pracy i oczekiwania na przerwanie (odbior komendy / przycisku nauka)
 *  - Po przerwaniu z portu IR -> odbior komandy
 *
 *
 *  Praca:
 *  - Ustawienie PWM
 *  - Ustawienie Przerwania do odbioru komend
 *
 *  - nowa komenda
 *  	logika stan akt, krok, cel, -> nowy (przyklad)
 *  			70		2		>=72	72
 *  			70		2		71		70
 *  			70		2		69		70
 *  			70		2		<=68	68
 *
 *  - Fade IN/OUT -> zbyteczne
 *
 *  przerwanie z portu:
 *  	ustawienie timera na 100us
 *  	zmienna odbior komendy
 *
 *  odbior komendy
 *  	rozpoznanie bit start / stop
 *  		rozpoznanie dlugosci
 *
 *  	rozpoznanie bitu komendy
 *  		stanu 1/0
 *  		zapamietanie bitu
 *
 *  	przerwanie komendy
 *  		licznik przekroczony gdy stan portu wysoki
 *
 *  	przetworzenie komendy (porownanie ze znanymi komendami)
 *  		zapamietanie
 *  		zmiana stanu wyjscia / PWM
 *  		blink
 *
 *
 *  Nauka komend pilota:
 *  - kolejno progi +,-, PWM_1/2/3
 *  	nowa komenda? -> zapamietanie
 *  	blink
 *
 *  - kontrolka Blink
 *
 *  Uspienie / Pamiec:
 *  - wylaczenie przerywania portu IR
 *  - wlaczenie monitorowanie stanu pracy lampy (wl / wyl)
 *  - wlaczenie trybu niskiego poboru mocy
 *  procesor nie ma pamieci. Tryb poboru niskiej mocy zeby 1 dzien pamietal w ram.
 *
 */

/* todo AAA synchronizacja czasow (nowy pilot), zapamietanie nowych czasow
 * - synchronizacja czasow (nowy pilot), zapamietanie nowych czasow
 * + sprawdzic dlugosc petli systemowej ~800 tikow
 * + debug -> do pamieci ile trwaly kolejne sygnaly
 * - fade in / out -> zbyteczne ?
 * + nieliniowa skala (kwadratowa)
 * - polowa (1/3?) czestotliwosci dla krotkich PWM
 * + min-max: brak przerywan ponizej progu minimalnego (dodatkowy tryb) oraz powyzej maksymalnego
 * - Praca z kwarca ???
 * - tryb uspienia LPM ???
 *
*/


#include "msp430g2231.h"
//#include "msp430g2452.h"

//#include "lib_rc.h"

#define PORT_CLR(a,b) 	a &= ~(b)
#define PORT_SET(a,b) 	a |= (b)
#define PORT(a,b) 	((b>0)?(P1OUT |= a):(P1OUT &= ~a))
#define LED_TOG
#define LED__ON
#define LED_OFF

// wejscia wyjscia
#define LED			BIT0	// LED czerwony port 1.0
#define WYJSCIE		BIT6	// PWM port 1.6

#define IR_DATA		BIT4	// wejscie IR port 1.4
#define SW_NAUKA	BIT3	// wejscie Przyciska nauka port 1.3

// Predef Mocy max = 250 / 1000
#define PWM_MAX		250
#define SKALA		PWM_MAX/100
#define PWM_MIN		10

#define PWM_1		20*SKALA
#define PWM_2		60*SKALA
#define PWM_3		90*SKALA

#define	PWM_PLUS	4*SKALA
#define PWM_MINU	-2*SKALA




// definicje do zegara
#define MHZ21		0   //  MHZ16		1

#define MHZ			1000000u
#define CLK_A		32768			// Cykl w trybie LPM3 przy zegarze ACLK = 32768Hz

#if MHZ21
#define CLK_S		21				// Cykl w trybie normalnym / LPM0 przy zegarze SMCLK = 21MHz
#else
#define CLK_S		16*1123			// Cykl w trybie normalnym / LPM0 przy zegarze SMCLK = 16MHz / DCO=6, RSEL=F 17968
#endif

//#define CLK_MAIN	CLK_S*MHZ			// glowny zegar

#define CLK_NAUKA	 100			// zegar us (skorygowany) (zegarek oraz 100 blink przez )
#define CLK_LOOP	1000			// wybrany zegar w mikrosek

#define CLK_LOOP_SET(a) (a==CLK_NAUKA)?(CLK_S/10):(CLK_S)

// liniowa skala
// #define PWM(a)		(a>PWM_MAX)?(PWM_MAX*CLK_S):((a*a)*CLK_S)
// #define PWM_NAUKA(a)	(a>>3)*CLK_S 					/* przeliczanie dla trybu nauki (timer 100us */

// nieliniowa skala
// wejscie 0-255; wyjscie
#if MHZ21
#define PWM(a)			(a>PWM_MAX)?(((PWM_MAX*PWM_MAX)/64)*CLK_S):(((a*a)>>6)*CLK_S) //
#define PWM_NAUKA(a)	(a>PWM_MAX)?(PWM_MAX*PWM_MAX):((a*a)>>5)	/* przeliczanie dla trybu nauki (timer 100us 21MHz */
#else
#define PWM(a)			(a>PWM_MAX)?(((PWM_MAX*PWM_MAX)/4)):(((a*a)>>2)) //
#define PWM_NAUKA(a)	(a>PWM_MAX)?(PWM_MAX*PWM_MAX):((a*a)>>5)	/* przeliczanie dla trybu nauki (timer 100us 16MHz */
#endif
//#define PWM(a)		((a*CLK_LOOP*CLK_S)/PWM_MAX)
//#define PWM_NAUKA(a) 	((a*CLK_NAUKA*CLK_S)/PWM_MAX)

#define KALIBRACJA_PILOTA 0
#define TEST 1

#if TEST == 0
#define USPIENIE 1
#define DEBUG_BLINK_ON
#define DEBUG_BLINK_OFF
#define DEBUG_KOMENDA 1
#else
#define USPIENIE 0
#define DEBUG_BLINK_ON(a)   P1OUT |= a										// debug blink Port 1.1
#define DEBUG_BLINK_OFF(a)  P1OUT &= ~a										// debug blink
#define DEBUG_KOMENDA 0
// tymczasowe
//static int powtorka;
static int temp1;

#endif


// Tryby pracy
typedef enum
{
	eInit,					// co po wlaczeniu
	eOperation,				// oczekiwanie na IR kod lub przycisk
	eOperationLoop,				// oczekiwanie na IR kod lub przycisk
	eInterrupt,				// przerywanie IR kod
	eOdbior,				// interpretacja komendy
	eNauka,					// nauka / logika
	eSave,					// zapis nowej komendy
	eUspienie,				// pauza
} eOPmodeT;
volatile eOPmodeT eOPmode;

typedef enum
{
	eStart0,
	eStart1,
	eStart2,
	eStart3,
	eStart4,
	eStart5,
	eStartEnd,
	eAdress,
	eKomenda,
	eStop,
	eKoniec,
	eNowa,
	eBlad,
} eIR_rcvStateT;
volatile eIR_rcvStateT eIR_rcvState;


// Zmienne globalne
#define COMMANDBITMAX 	64			// dlugosc_7 - ilosc bitow komendy musi byc mniejsza niz 64

// zmienne modyfikowane w przerywaniu
volatile static char Nauka;			// etapy nauki
//static int LED_Kod;
volatile static int blinkToggle;			// etapy nauki
volatile static int blink;
volatile static int blinkCnt;

static volatile int rcvLicznikC;	// Licznik calkowity mierzacy ciagle od poczatku komendy
static volatile int rcvPortCur;

//----
static int CommandCode[COMMANDBITMAX/16];	// bufor do odbioru komendy
static int CommandBit;				// ktory bit komendy

volatile int rcvLicznik;				// Licznik do mierzenia dlugosci bitu
static int rcvLicznikO;				// ostatni stan licznika calkowitego

static int PWMwyjscie;				// stan wyjscia 16bit
static int PWMwyjscieN;				// nowy (docelowy) stan wyjscia po odebraniu komendy

