drcoolj/msp430_lampa_rc5/main.c
/*
  static int TablicaKomendNauka[5][4]={
	{ 0x0010, 0x3402, 0x4A7C, 0x0000}, // PWM_1
	{ 0x0010, 0x3400, 0x4174, 0x0000}, // PWM_2
	{ 0x0010, 0x3400, 0x497C, 0x0000}, // PWM_3
	{ 0x0010, 0x3400, 0xB084, 0x0000}, // PWM_PLUS
	{ 0x0010, 0x3402, 0xB284, 0x0000}  // PWM_MINUS
};
*/
static int TablicaKomendNauka[5][4];



//! czasy w komendzie w jednostce 1us
static const int dlugosc_start0 = 3440/CLK_NAUKA;		// dlugosc_start0 - nowa transmisja -stan 0
static const int dlugosc_start1 = 1720/CLK_NAUKA;		// dlugosc_start1 - start stan 1
static const int dlugosc_bit =  430/CLK_NAUKA;		// dlugosc_bit - marker bitu, stan 0
static const int dlugosc_1 = 1720/CLK_NAUKA;		// dlugosc_2 - dlugi bit = 1, stan 1; (430+1290)
static const int dlugosc_0 = 860/CLK_NAUKA;		// dlugosc_3 - krotki bit = 0, stan 1+0; (430+ 430)
static const int dlugosc_pauza = 1290/CLK_NAUKA;		// dlugosc_4 - pauza, stan 1+0
static const int dlugosc_blad = 3000/CLK_NAUKA;		// dlugosc_6 - blad, przerwanie odbioru
static const int dlugosc_korekcja = 400/CLK_NAUKA;		// dlugosc_korekcja blad rozpoznania komendy

//static volatile int dlugosc_start0;		// dlugosc_start0 - nowa transmisja -stan 0
//static volatile int dlugosc_start1;		// dlugosc_start1 - start stan 1
//static volatile int dlugosc_bit;			// dlugosc_bit - marker bitu, stan 0
//static volatile int dlugosc_1;				// dlugosc_2 - dlugi bit = 1, stan 1
//static volatile int dlugosc_0;				// dlugosc_3 - krotki bit = 0, stan 1
//static const int dlugosc_pauza 	= 1290/CLK_NAUKA;		// dlugosc_4 - pauza, stan 1
//static const int dlugosc_blad 	= 60000/CLK_NAUKA;		// dlugosc_6 - blad, przerwanie odbioru
//static const int dlugosc_korekcja =100/CLK_NAUKA;		// dlugosc_korekcja blad rozpoznania komendy

//static const int dlugosc_koniec = 3000/CLK_NAUKA;		// dlugosc_5 - koniec komendy


//! blok modyfikacji wyjscia
static const int TablicaPWM[] = {
		PWM_1,
		PWM_2,
		PWM_3,
		PWM_PLUS,
		PWM_MINU,
};

#pragma DATA_SECTION(TablicaKomend, ".infoD")
//! blok w pamieci ktory bedzie nadpisany przy zapamietaniu nowej komendy
static const int TablicaKomend[5][4]={
	{ 0x0010, 0x3402, 0x4A7C, 0x0000}, // PWM_1
	{ 0x0010, 0x3400, 0x4174, 0x0000}, // PWM_2
	{ 0x0010, 0x3400, 0x497C, 0x0000}, // PWM_3
	{ 0x0010, 0x3400, 0xB084, 0x0000}, // PWM_PLUS
	{ 0x0010, 0x3402, 0xB284, 0x0000}  // PWM_MINUS
};



void write_FlashSegD (int *Flash_ptr,int *Data, char Length);

//! Initialize the MSP430 clock.
void msp430_init_dco() {

	if(CALBC1_1MHZ!=0xFF){
		//Clear DCL for BCL12
		DCOCTL = 0x00;
		//Info is intact, use it.
		BCSCTL1 = CALBC1_1MHZ;
		DCOCTL = CALDCO_1MHZ;
	}else{
		//Info is missing, guess at a good value.
//		BCSCTL1 = 0x8f;   //CALBC1_16MHZ at 0x10f9
//		DCOCTL = 0x7f;    //CALDCO_16MHZ at 0x10f8

	}
#if MHZ21
	DCOCTL |= 0xE0;							// 21MHz
	BCSCTL1|= 0x0F;
#else
	//DCOCTL |= 0x60;							// ~16,9MHz
	BCSCTL1|= 0x0F;

#endif
	BCSCTL2 &= ~SELS;		  				// SMCLK source


}

int main(void) {

//	//static int TablicaKomendSzukaj[]={0,0,1,2,3,4};	// Tablica do poszukiwania komendy
	int ii,jj;							// zmienne pomocnicze
	int temp3,temp2;

	/*
	 * IR Decoder
	 * Decode and respond to RC5 IR remote control commands, using a TSOP38238SS1V receiver IC
	 * Copyright: Jerry Pommer <jerry@jerrypommer.com> 2012-12-04
	 * License: GNU General Public License v3
*/
	WDTCTL = WDTPW | WDTHOLD;    			// disable watchdog
	Nauka = 0;
	PWMwyjscie = PWM_3;
	blink=1000;                				// P1.0 LED =1 zapalic
	//blinkToggle=500;						// kalibracja timera
	eOPmode = eInit;
	msp430_init_dco();

	memset(TablicaKomendNauka,0,sizeof(TablicaKomendNauka));

//	dlugosc_start0 = 3440/CLK_NAUKA;		// dlugosc_start0 - nowa transmisja -stan 0
//	dlugosc_start1 = 1720/CLK_NAUKA;		// dlugosc_start1 - start stan 1
//	dlugosc_bit 	=  430/CLK_NAUKA;		// dlugosc_bit - marker bitu, stan 0
//	dlugosc_1 		=  860/CLK_NAUKA;		// dlugosc_2 - dlugi bit = 1, stan 1
//	dlugosc_0 		=  430/CLK_NAUKA;		// dlugosc_3 - krotki bit = 0, stan 1

//	dlugosc_start0 = 0;		// dlugosc_start0 - nowa transmisja -stan 0
//	dlugosc_start1 = 0;		// dlugosc_start1 - start stan 1
//	dlugosc_bit 	=  0;		// dlugosc_bit - marker bitu, stan 0
//	dlugosc_1 		=  0;		// dlugosc_2 - dlugi bit = 1, stan 1
//	dlugosc_0 		=  0;		// dlugosc_3 - krotki bit = 0, stan 1


//	dlugosc_pauza 	= 1290/CLK_NAUKA;		// dlugosc_4 - pauza, stan 1
	//static int dlugosc_koniec = 3000/CLK_LOOP;		// dlugosc_5 - koniec komendy
//	static const int dlugosc_blad 	= 6000/CLK_NAUKA;		// dlugosc_6 - blad, przerwanie odbioru
//	static const int dlugosc_korekcja =100/CLK_NAUKA;		// dlugosc_korekcja blad rozpoznania komendy


	temp1=0;
	temp3 = TAR;

	for(;;) {
		volatile unsigned int i;			// volatile to prevent optimization

		temp2 = TAR-temp3;
		if(temp2>temp1)
			temp1=temp2;
		temp3 = TAR;

		switch (eOPmode)
		{
		case eInit:
/*
 *  Uruchomienie / Inicjalizacja
 *  - inicjalizacja portow
 *  - po wlaczeniu ustawienie domyslnego wyjscia
 *  - przejscie w tryb Pracy
 */

			PORT_CLR(P1DIR,IR_DATA);				// IRDATA is an input
			PORT_CLR(P1OUT,LED|WYJSCIE|BIT1|BIT2);	// Set all these LOW
			P1DIR |= LED | WYJSCIE;					// Set all these as outputs
//			PORT_SET(P1SEL,WYJSCIE);                // P1.6 funkcja, wyjscie zegara, (TA0.1 output) aktywna (SET)
			PORT_CLR(P1SEL,WYJSCIE);                // P1.6 funkcja, wyjscie zegara, (TA0.1 output) nieaktywna (CLEAR)
													// Interrupt
			P1IES |= IR_DATA;						// watch for falling edge change on IRDATA
			P1IFG 	= 0;							// clear the P1 interrupt flags
			P1IE = IR_DATA|SW_NAUKA;				// enable interrupts, watching IRDATA and SW_NAUKA for a change

			// Ustawienie Zegara
			TACTL = TACLR;
			//TACTL = TASSEL_1 + MC_1				// ACLK 32768 Hz, up mode
			TACTL = TASSEL_2 + MC_1 + TAIE;			// SMCLK 1MHz, up mode
			CCTL0 = CCIE;                          	// CCR0 interrupt enabled
			CCTL1 = CCIE;                         	// CCR1 interrupt enabled
			CCR0 = CLK_LOOP_SET(CLK_LOOP);			// Ustalenie Taktu; licznik liczy od 0 do PWM_TAKT po tym interrupt
			CCR1 = PWM(PWMwyjscie);					// Ustawienie wyjscia

