drcoolj/msp430_lampa_rc5/main.c
// manual / automatycznie
/*
 			P1.0,1 oraz P1.4 maja wyjscie sterowane prosto z zegara jesli SEL = 1
			PORT_CLR(P1DIR,WYJSCIE);                // Zerowanie wyjscia
			PORT_SET(P1SEL,WYJSCIE);                // P1.6 funkcja, wyjscie zegara, (TA0.1 output) aktywna (SET)
			CCTL1 = OUTMOD_7;                       // CCR1 reset/set
			CCTL0 &= ~CCIE;                         // CCR0 interrupt enabled
			CCTL1 &= ~CCIE;                         // CCR1 interrupt enabled
*/

			__bis_SR_register(GIE);					// interrupts enabled

			// koniec inicjalizacji
			eOPmode = eUspienie;
			eIR_rcvState = eStart0;

			break;

		case eInterrupt:
/*
 *  przerwanie z portu:
 *  - ustawienie timera na 100us
 *  - zmienna odbior komendy
 *
 *	kasowanie zmiennych: Liczniki, bufor odbioru
 *
 */
			rcvLicznikC = 0;
			rcvLicznikO = 0;
			rcvLicznik = 0;
			rcvPortCur = 1;

			CommandCode [0]=0;
			CommandCode [1]=0;
			CommandCode [2]=0;
			CommandCode [3]=0;
			CommandBit = 0;

			eOPmode = eOdbior;

			// Ustawienie Zegara
			TACTL = TACLR;
			//TACTL = TASSEL_1 + MC_1				// ACLK 32768 Hz, up mode
			TACTL = TASSEL_2 + MC_1 + TAIE;		// SMCLK 1MHz, up mode
			//CCTL0 = CCIE;                         // CCR0 interrupt enabled

			CCR0 = CLK_LOOP_SET(CLK_NAUKA);			// Ustalenie Taktu; licznik liczy od 0 do CLK_NAUKA po tym interrupt
			CCR1 = PWM_NAUKA(PWMwyjscie);
//			CCTL1 &= ~CCIE;                         // CCR1 interrupt disabled

			// powtorka = 0;
			break;

		case eOdbior:
/*
 *  odbior komendy:
 *
 *  w petli:
 *  nowy stan licznika? tak, inkrementowac licznik i dalej : nie, czekac,
 *  rozpoznanie bitu, nowy stan? tak, dalej : nie, czekac
 *  	zapamietanie nowego stanu portu
 *  	ocena dlugosci stanu (rozpoznanie bitu)
 *  	dlugosc_1 - start
 *  	dlugosc_2 - dlugi bit = 1
 *  	dlugosc_3 - krotki bit = 0
 *  	dlugosc_4 - pauza
 *  	dlugosc_5 - koniec komendy
 *  	dlugosc_6 - blad, przerwanie odbioru
 *  kasowanie licznika bitu
 *
 *  zapamietanie bitu komendy
 *
 *  przetworzenie komendy (porownanie ze znanymi komendami)
 *
 *  zapamietanie
 *  zmiana stanu wyjscia / PWM
 *  blink
 *
 *
 */
//			rcvLicznikO -= rcvLicznikC;
			if((rcvLicznikC - rcvLicznikO) != 0)
			{	// nowy stan licznika calkowitego -> znaczy minelo X razy CLK_NAUKA us,

				rcvLicznik += rcvLicznikC - rcvLicznikO;							// inkrementacja licznika czasu odbioru
				// rcvPortCur zerowane po przerwaniu
//				rcvPortCur = P1IN & IR_DATA;

				// ---- Debug
//				if ((rcvPortOst == 0) && (0 != rcvPortCur)) {
//					CommandCode [0] += 1;
//					DEBUG_BLINK_OFF(BIT0);
//				}
//				else
//				{
//					DEBUG_BLINK_ON(BIT0);
//				}

//				CommandCode [0] <<= -rcvLicznikO;
				// ---- Debug

				switch (eIR_rcvState)
				{
/*
				case eStart0:
					if (rcvPortOst == 0) {
					if (rcvPortCur)
					{// rozpoznanie bitu startu, nowy stan = 1? tak, dalej : nie, czekac na 1
						DEBUG_BLINK_ON(BIT0);
//						if ((rcvLicznik > dlugosc_start0-dlugosc_korekcja) && (rcvLicznik < dlugosc_start0+dlugosc_korekcja))
						{
							dlugosc_start0 = rcvLicznik;
							eIR_rcvState = eStart1; 				// Bit Startu odebrany; stan niski OK
							rcvLicznik=0;							// kasowanie licznika
						}
					}}
					break;
				case eStart1:
					if ((rcvPortOst != 0) && !(rcvPortCur))
					{// rozpoznanie bitu startu, nowy stan = 0? tak, dalej : nie, czekac na 0
//						if ((rcvLicznik > dlugosc_start1-dlugosc_korekcja) && (rcvLicznik < dlugosc_start1+dlugosc_korekcja))
						{
							dlugosc_start1 = rcvLicznik;
							eIR_rcvState = eKomenda; 				// Bit Startu odebrany; stan wysoki OK
							rcvLicznik=0;							// kasowanie licznika
						}
					}
					break;
*/
				case eStartEnd:
					eIR_rcvState = eKomenda; 				// Bit Startu odebrany; stan wysoki OK
					rcvLicznik=1;							// kasowanie licznika
					break;

				case eKomenda:
					if (!(rcvPortCur)) {
						// rozpoznanie bitu, nowy stan = 0? tak, dalej : nie, czekac na 0
						// zapamietanie bitu komendy
//						DEBUG_BLINK_ON(BIT0);

						if ((rcvLicznik >= dlugosc_0-dlugosc_korekcja) && (rcvLicznik < dlugosc_0+dlugosc_korekcja))
						{ // zero
							CommandCode[CommandBit>>4] <<= 1;
							CommandBit++;
						}
						else if ((rcvLicznik >= dlugosc_1-dlugosc_korekcja) && (rcvLicznik < dlugosc_1+dlugosc_korekcja))
						{ // jedynka
							CommandCode[CommandBit>>4] = CommandCode[CommandBit>>4] << 1;
							CommandBit++;
							CommandCode[CommandBit>>4]++;
						}
						else
						{ // pauza
							// powtorka++;
						}

						if (CommandBit == COMMANDBITMAX-1)
						{	// bufor pelny / blad
							eIR_rcvState = eStop;
						}

						// tylko w celu debugowania
#if DEBUG_KOMENDA
						CommandBit--;
						TablicaKomendNauka[CommandBit>>4][0x0003&(CommandBit>>2)] = TablicaKomendNauka[CommandBit>>4][0x0003&(CommandBit>>2)] << 4;
						TablicaKomendNauka[CommandBit>>4][0x0003&(CommandBit>>2)] += rcvLicznik>>3;
						CommandBit++;
#endif

						rcvLicznik=1;						// kasowanie licznika impulsow
						rcvPortCur = 1;						// zapamietanie aktualnego stanu portu
						P1IE |= IR_DATA;					// Turn on P1 interrupts while we work
					}
					else{	// odbierany jest stan niski
						if (rcvLicznik >= dlugosc_blad)
							//eOPmode = eOperation;		// za dlugo / blad
							eIR_rcvState = eStop;		// za dlugo koniec odbioru / blad
//							DEBUG_BLINK_OFF(BIT0);
						}
					break;

				case eStop:
				case eKoniec:
					// nowa komenda; porownanie ze znanymi komendami

					// tylko w celu debugowania
					CommandCode[CommandBit>>4] <<=  16 * (1+ (CommandBit>>4))- CommandBit;
					TablicaKomendNauka[CommandBit>>4][0x0003&(CommandBit>>2)] <<= 4 * (16 * (1+ (CommandBit>>4))- CommandBit);

					if (Nauka != 0)
					{
						eIR_rcvState = eKoniec;									// tymczasowa zmienna, jesli zostanie zmienione na stop to znaczy nie znana komenda
						for(ii=0; ii < sizeof(CommandCode)/sizeof(CommandCode[0]); ii++)
						{	// zapamietanie Komendy
							if ((Nauka>1) && (CommandCode[ii] != TablicaKomend[Nauka-2][ii]))
								eIR_rcvState = eStop;							// nie pasuje do znanego musteru -> nowa komenda

							TablicaKomendNauka[Nauka-1][ii]=CommandCode[ii];
						}
						if ((Nauka>1) && (eIR_rcvState == eKoniec))				// komenda taka sama co ostatnio, zignorowac
						{
							Nauka--;
						}
						Nauka++;
						eOPmode = eNauka;
					}
					else {
						PWMwyjscieN = PWMwyjscie;									// bez zmian prosze jesli komenda nierozpoznana

						for(ii=0; ii < sizeof(TablicaKomend)/sizeof(TablicaKomend[0]); ii++)
						{
							eIR_rcvState = eKoniec;									// tymczasowa zmienna, jesli zostanie zmienione na stop to znaczy nie znana komenda
							for(jj=0; jj<sizeof(CommandCode)/sizeof(CommandCode[0]); jj++)
							{
								if (CommandCode[jj]!=TablicaKomend[ii][jj])
									eIR_rcvState = eStop;							// nie pasuje do znanego musteru
							}
							if (eIR_rcvState == eKoniec)
							{	// komenda znalezina (ii)
								// nowe wartosci predefiniowane
								if (ii<3)
								{	// wartosci predefiniowane
									PWMwyjscieN = TablicaPWM[ii];
								}
								else
								{	// wartosci modyfikowane + / -
									PWMwyjscieN = PWMwyjscie+TablicaPWM[ii];
									if(PWMwyjscieN < 0) PWMwyjscieN = 0;
									else if (PWMwyjscieN > PWM_MAX) PWMwyjscieN = PWM_MAX;

