drcoolj/msp430_lampa_rc5/main.c
								}
								ii = sizeof(TablicaKomend[0]); 		// koniec poszukiwania
							}
						}
						eOPmode = eOperation;					// nowa komenda przetworzona
					}

					blink = 100;
					if(CommandBit<46)
						blink = 1000;						// bledna komenda

					CCR0 = CLK_LOOP_SET(CLK_LOOP);			// Ustalenie Taktu; licznik liczy od 0 do PWM_TAKT po tym interrupt
					P1IE = IR_DATA|SW_NAUKA;				// enable interrupts, watching IRDATA and SW_NAUKA for a change
					break;

				default:
					break;
				}

				rcvLicznikO = rcvLicznikC;
			}
			break;

		case eOperation:
/*
 *  Praca:
 *  - Ustawienie PWM
 *  - Ustawienie Przerwania do odbioru komend
 *
 *  - nowa komenda
 *  	logika stan akt, krok, cel, -> nowy (przyklad)
 *  			70		2		>=72	72
 *  			70		2		71		70
 *  			70		2		69		70
 *  			70		2		<=68	68
 *
 *  - Fade IN/OUT
 *
 *	- skalowanie wyjscia
 */


			// \Todo fade in/ out
			PWMwyjscie = PWMwyjscieN;

			// min-max: brak przerywan ponizej progu minimalnego (dodatkowy tryb) oraz powyzej maksymalnego
			if (PWM_MIN > PWMwyjscie)
				CCTL1 &= ~CCIE;             // CCR1 interrupt enabled
			else
				CCTL1 |= CCIE;              // CCR1 interrupt enabled

			CCR1 = PWM(PWMwyjscie);			// Ustawienie wyjscia

			eOPmode = eUspienie;
			eIR_rcvState = eStart0;
			break;

		case eUspienie:
#if USPIENIE == 1
			if (blink == 0)
				__bis_SR_register(CPUOFF + GIE);		// Low Power Mode 0 with interrupts enabled

#endif
			break;

		case eNauka:
/*
 *  Nauka komend pilota:
 *  - kolejno progi +,-, PWM_1/2/3
 *  	nowa komenda? -> zapamietanie
 *  	blink
 *
 */
			eOPmode = eOperation;					// nowa komenda przetworzona

			if (Nauka == 1+(sizeof(TablicaPWM)/sizeof(TablicaPWM[0])))
			{	// nowe kody odebrane
				write_FlashSegD((int *)TablicaKomend, (int *)TablicaKomendNauka, sizeof(TablicaKomendNauka)/sizeof(int));

				// nowa tablica zapamietana
				memset(TablicaKomendNauka,0,sizeof(TablicaKomendNauka));

				// skasowanie licznika nauki
				blink = 1000;
				Nauka = 0;
				eOPmode = eOperation;				// nowa komenda przetworzona
			}
			else
			{
//				blink = 100;

				Nauka--;
				// nowe wartosci predefiniowane
				if ((Nauka)<3)
				{	// wartosci predefiniowane
					PWMwyjscieN = TablicaPWM[Nauka];
				}
				else
				{	// wartosci modyfikowane + / -
					PWMwyjscieN = PWMwyjscie+TablicaPWM[Nauka];
				}
				Nauka++;
			}
			break;

		default:
			break;

		}

		if (blinkCnt != 0) {
			if (blinkCnt > blink+1)
			{
				PORT(LED,1);                // P1.6 LED =1 zapalic
			}
			else
			{
				PORT(LED,0);                // P1.6 LED =0 zgasic
			}
		} else {
			if (blinkToggle) {
				blinkCnt = blinkToggle<<1;
				blink=blinkToggle;
			} else if (blink)
			{
				blinkCnt = blink;
				blink = 0;
			}
		}

	}


	return 0;
}


void write_FlashSegD (int *Flash_ptr, int *Data, char Length)
{
//  char *Flash_ptr;       					  // Flash pointer
	unsigned int i;
	int temp1,temp2;

    temp1 = BCSCTL1;
    temp2 = DCOCTL;

    DCOCTL = 0;                               // Select lowest DCOx and MODx settings
	BCSCTL1 = CALBC1_1MHZ;                    // Set DCO to 1MHz
	DCOCTL = CALDCO_1MHZ;

	FCTL2 = FWKEY + FSSEL0 + FN1;             // MCLK/3 for Flash Timing Generator
	FCTL1 = FWKEY + ERASE;                    // Set Erase bit
	FCTL3 = FWKEY;                            // Clear Lock bit

	*Flash_ptr = 0;                           // Dummy write to erase Flash segment

	FCTL1 = FWKEY + WRT;                      // Set WRT bit for write operation

	for (i=0; i<Length; i++)
	{
		*Flash_ptr++ = *Data++;				  // Write value to flash
	}

	FCTL1 = FWKEY;                            // Clear WRT bit
	FCTL3 = FWKEY + LOCK;                     // Set LOCK bit

    BCSCTL1 = temp1;
    DCOCTL = temp2;

}

/*
 *	przerwanie uzywane do sterowania PWM;
 *	przerwanie wywolane jesli stan licznika TAR jest rowny Rejestrowi CCR0=TAR (koniec cyklu)
 *	licznik bignie dalej od 0, port przelaczyc na stan wysoki
 *
 */

// Timer A0 interrupt service routine
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=TIMER0_A0_VECTOR
__interrupt void Timer_A0 (void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(TIMERA0_VECTOR))) Timer_A0 (void)
#else
#error Compiler not supported!
#endif
{
											// eOPmode = eOperation;
	rcvLicznikC++;							// inkrementacja glownego licznika
	if (blinkCnt)
		blinkCnt--;
	if( CCTL1 & CCIE)             			// CCR1 interrupt enabled
		PORT(WYJSCIE,1);						// przerzucanie stanu portu 0 -> 1


}

/*
 *	przerwanie uzywane do sterowania PWM;
 *	przerwanie wywolane jesli stan licznika TAR jest rowny Rejestrowi CCR1=TAR (regulacja wypelnienia PWM)
 *	licznik bignie dalej
 *
 */

// Timer_A2 Interrupt Vector (TAIV) handler
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=TIMER0_A1_VECTOR
__interrupt void Timer_A1(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(TIMERA1_VECTOR))) Timer_A1 (void)
#else
#error Compiler not supported!
#endif
{
	switch( TAIV )
	{
	case  2:
		PORT(WYJSCIE,0);						// przerzucanie stanu portu 1 -> 0
		break;
	case 10:
		break;
	}
}

/*!
 *  przerwanie z portu:
 *  1) PORT IR (zbocze opadajace)
 * *
 *	2) przycisk
 */

#pragma vector = PORT1_VECTOR;
void __interrupt Port_1(void)
{

#if KALIBRACJA_PILOTA
	if (IR_DATA & P1IFG)
	{	// IR port -> przerwanie
		P1IFG &= ~IR_DATA;							// clear the P1 interrupt flag for IRDATA
		if (eOPmode == eUspienie)
			eOPmode = eInterrupt;

		switch (eIR_rcvState)
		{
		case eStart0:
			eIR_rcvState = eStart1; 				// Bit Startu odebrany; stan niski OK
  			P1IES &= ~IR_DATA;						// now watch for Rising edge change on IRDATA
  			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
  			break;
		case eStart1:
  			dlugosc_start0 = rcvLicznikC;
			eIR_rcvState = eStart2; 				// Bit Startu odebrany; stan niski OK
  			P1IES |= IR_DATA;						// now watch for falling edge change on IRDATA
  			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
			break;
		case eStart2:
  			dlugosc_start1 = rcvLicznikC;
			eIR_rcvState = eStart3; 				// Bit Startu odebrany; stan wysoki OK
  			P1IES &= ~IR_DATA;						// now watch for Rising edge change on IRDATA
  			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
			break;
		case eStart3:
  			dlugosc_bit = rcvLicznikC;
			eIR_rcvState = eStart4; 				// Znacznik bitu odebrany (niski)
  			P1IES |= IR_DATA;						// now watch for falling edge change on IRDATA
  			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
  			break;
		case eStart4:
  			dlugosc_0 = rcvLicznikC; 				// Bit 0 odebrany (wysoki)
			eIR_rcvState = eStart5; 				//
  			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
			break;
		case eStart5:
  			dlugosc_1 = rcvLicznikC-dlugosc_0; 		// Bit 1 odebrany (wysoki)
  			dlugosc_0 = dlugosc_0-dlugosc_start1; 		// Bit 0 odebrany (wysoki)
  			dlugosc_bit = dlugosc_bit-dlugosc_start1;
  			dlugosc_start1 = dlugosc_start1-dlugosc_start0;
			eIR_rcvState = eStartEnd; 				//
  			P1IE &= ~IR_DATA;						// Turn off P1 interrupts while we work
			break;
#else
			if (IR_DATA & P1IFG)
			{	// IR port -> przerwanie
				P1IFG &= ~IR_DATA;							// clear the P1 interrupt flag for IRDATA
				if (eOPmode == eUspienie)
					eOPmode = eInterrupt;

				switch (eIR_rcvState)
				{
				case eStart0:
					eIR_rcvState = eStart1; 				// Bit Startu odebrany; stan niski OK
//					break;									// no break
				case eStart1:
					eIR_rcvState = eStart2; 				// Bit Startu odebrany; stan niski OK
					break;
				case eStart2:
					eIR_rcvState = eStart3; 				// Bit Startu odebrany; stan wysoki OK
					break;
				case eStart3:
					eIR_rcvState = eStart4; 				// Znacznik bitu odebrany (niski)
//					break;									// no break
				case eStart4:
					eIR_rcvState = eStart5; 				//
					break;
				case eStart5:
					eIR_rcvState = eStartEnd; 				//
					break;
#endif
/*
					if (IR_DATA & P1IFG)
					{	// IR port -> przerwanie
						P1IFG &= ~IR_DATA;							// clear the P1 interrupt flag for IRDATA
						if (eOPmode == eUspienie)
							eOPmode = eInterrupt;

						switch (eIR_rcvState)
						{
						case eStart0:
							eIR_rcvState = eStart1; 				// Bit Startu odebrany; stan niski OK
				//			P1IES &= ~IR_DATA;						// now watch for Rising edge change on IRDATA
				//			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
				//			break;
						case eStart1:
				//			dlugosc_start0 = rcvLicznikC;
							eIR_rcvState = eStart2; 				// Bit Startu odebrany; stan niski OK
				//			P1IES |= IR_DATA;						// now watch for falling edge change on IRDATA
				//			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
							break;
						case eStart2:
				//			dlugosc_start1 = rcvLicznikC;
							eIR_rcvState = eStart3; 				// Bit Startu odebrany; stan wysoki OK
				//			P1IES &= ~IR_DATA;						// now watch for Rising edge change on IRDATA
				//			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
							break;
						case eStart3:
				//			dlugosc_bit = rcvLicznikC;
							eIR_rcvState = eStart4; 				// Znacznik bitu odebrany (niski)
				//			P1IES |= IR_DATA;						// now watch for falling edge change on IRDATA
				//			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
				//			break;
						case eStart4:
				//			dlugosc_0 = rcvLicznikC; 				// Bit 0 odebrany (wysoki)
							eIR_rcvState = eStart5; 				//
				//			P1IE |= IR_DATA;						// Turn on P1 interrupts while we work
							break;
						case eStart5:
				//			dlugosc_1 = rcvLicznikC-dlugosc_0; 		// Bit 1 odebrany (wysoki)
				//			dlugosc_0 = dlugosc_0-dlugosc_start1; 		// Bit 0 odebrany (wysoki)
				//			dlugosc_bit = dlugosc_bit-dlugosc_start1;
				//			dlugosc_start1 = dlugosc_start1-dlugosc_start0;
							eIR_rcvState = eStartEnd; 				//
				//			P1IE &= ~IR_DATA;						// Turn off P1 interrupts while we work
							break;
*/
		default:
			//										debug, command processiny by interrupt
			P1IE &= ~IR_DATA;						// Turn off P1 interrupts while we work
			rcvPortCur = 0;
			break;
		}
	}
	else if (SW_NAUKA & P1IFG)
	{	// przycisk -> Nauka
		P1IFG &= ~SW_NAUKA;							// clear the P1 interrupt flag for SW_NAUKA
		if (eOPmode == eUspienie)
			eOPmode = eNauka;
		Nauka = 1;
	}

