drcoolj/msp430_lampa_rc5/main.c
	//TODO: wait for second start bit within T_INTERVAL; abandon if it doesn't come.


}

/**
\dot
digraph G {"
eInit	->	eOperation	;
eOperation	->	eUspienie	;
eUspienie	->	eUspienie	;
eOdbior	->	eOperation	;
eNauka	->	eOdbior	;
eInterrupt Timer0	->	PWM_ON	;
eInterrupt Timer1	->	PWM_OFF	;
eInterrupt Port IR	->	eOdbior	;
eInterrupt BUTTON	->	eNauka	;
"}
\enddot
*/


/**
 *
 * TACTL - Timer A Control Register

The Timer A clock source (TASSELx)
– TACLK (TASSEL_0)
– ACLK  (TASSEL_1)
– SMCLK (TASSEL_2)
– INCLK (TASSEL_3)

These bits select the divider for the input clock (IDx)
– (ID_0) is divide by 1
– (ID_1) is divide by 2
– (ID_2) is divide by 4
– (ID_3) is divide by 8

Clock mode control (MC_1)
– (MC_0) Stop mode: the timer halts
– (MC_1) Up mode: the timer counts up CCR0
– (MC_2) Continuous mode: the timer counts up to the max value of CCR0
– (MC_3) Up down mode: the timer counts up CCR0 and then down to 0x0000h


6 Types of Low Power Modes
- AM   – All clocks are active
- LPM0 - The CPU is disabled and MCLK is disabled.
- LPM1 - The DCO’s generator is disabled.
- LPM2 – SMCLK is also disabled.
- LPM3 – Same as LPM2. Don’t know why this was added.
- LPM4 – The ACLK and the crystal oscillator are also disabled.
• NOTE: As Low Power mode rises, all previous low power modes are also included – (Ex. LPM3 includes LPM0-LPM2)


PWM Code: Out Modes
– OUTMOD_0
– OUTMOD_1
– OUTMOD_2
– OUTMOD_3: The output is set when the timer counts to the TACCRx value. It is reset when the timer counts to the TACCR0 value
– OUTMOD_4
– OUTMOD_5
– OUTMOD_6
– OUTMOD_7: The output is reset when the timer counts to the TACCRx value. It is set when the timer counts to the TACCR0 value.
• Only worry about OUTMOD_3 and OUTMOD_7


http://www.egr.msu.edu/classes/ece480/capstone/fall10/group04/Dong,%20Roy%20-%20Application%20Note.pdf


For example, from pg. 6 of the MSP430G2231
datasheet, pin 4 is “P1.2/TA0.1/A2”. We want to use this pin as “TA0.1”. To do this, we have to set second
bit of both the P1SEL and P1DIR registers accordingly. Generally, to set the Px.y pin, we must set the
PxSEL and PxDIR registers accordingly at bit y. A 0 in PxDIR is input; a 1 is output. A 0 in PxSEL means
general purpose input/output, while a 1 in PxSEL reflects a special purpose based on the pin. For
example, to use the timer, we would set the appropriate bits in PxSEL and PxDIR to 1. To use the ADC
converter (A2), we would set PxSEL to 1 and PxDIR to 0. The code to set the pin as a timer is as follows:
P1DIR |= BIT2;
P1SEL |= BIT2;


 *
 */
